# Null value handeling

In [3]:
import pandas as pd

In [4]:
students_performance = pd.read_csv(
    r"D:\AI ML ENGINEERING JOURNY\02_Python_Foundations\04_Pandas\dataset\students_performance.csv")

In [5]:
students_performance

,student_id,name,age,gender,math_score,english_score,attendance_percentage,parent_income
0,101,Aman,20.0,M,78.0,85.0,92.0,50000.0
1,102,Riya,19.0,F,88.0,NaN,95.0,60000.0
2,103,Karan,21.0,M,67.0,72.0,NaN,45000.0
3,104,Sneha,20.0,F,NaN,90.0,88.0,NaN
4,105,Arjun,22.0,M,91.0,89.0,96.0,75000.0
5,106,Pooja,19.0,F,73.0,68.0,85.0,40000.0
6,107,Rahul,NaN,M,84.0,79.0,90.0,52000.0
7,108,Anjali,20.0,F,95.0,92.0,98.0,80000.0
8,109,Vikram,21.0,M,59.0,65.0,70.0,NaN
9,110,Neha,19.0,F,82.0,NaN,93.0,58000.0